ОптоваяТорговля/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОптоваяТорговля/src/CommonModules/ЦеныНоменклатуры/Module.bsl
#Область ПрограммныйИнтерфейс
 
// Цена номенклатуры.
// 
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура
//  Организация - СправочникСсылка.Организации
//  Период - Дата, Неопределено - Период
// 
// Возвращаемое значение:
//  Число - Цена номенклатуры
//
Функция ЦенаНоменклатуры(Номенклатура, Организация, Период = Неопределено) Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура);
	Отбор.Вставить("Организация", Организация);
	
	РеквизитыЗаписи = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(Период, Отбор);
	
	Возврат РеквизитыЗаписи.Цена;
	
КонецФункции

#КонецОбласти
